#include "Mul.h"
/*
功能：实现两个整数之间的乘法运算
参数：a 乘数   b 乘数
返回值：成功返回两个数相处的结果    数据溢出打印溢出信息，返回-1
*/
int Mul(int a, int b)
{
	if (a == 0 || b == 0)	//乘数之中有一个为0，则结果为0
		return 0;
	/*首先判断两个乘数是否同号，同号可能正溢出，不同号可能负溢出*/
	if ((a & 1 << 31)^(b & 1 << 31))	//判断a，b是否同号，取最高位的数进行异或  相同为0 不同为1
	{//不同号，进行负溢出判断
		if ((a > 0) && (b < (-INT_MAX - 1) / a))//a大于0时 负溢出判断
		{
			printf("乘法数据负溢出\n");
			return -1;
		}
		if ((a < 0) && (b >(-INT_MAX -1)/a))	//a<0时 负溢出判断
		{
			printf("乘法数据负溢出\n");
			return -1;
		}
	}
	else              // 同号时，正溢出判断   
	{
		if ((a > 0) && (b > INT_MAX / a))	//a>0时  正溢出判断
		{
			printf(" b = %d 乘法数据正溢出\n",b);
			return -1;
		}
		if ((a < 0) && (b < INT_MAX / a))	//a<0时 正溢出判断
		{
			printf("乘法数据正溢出\n");
			return -1;
		}
	}
	return a * b;	//正常时
}
